Polozov2005/PME-RGR/Tina9-TI/vhdl/MCU/Include/avr/ATMEGA649V.inc
; MCUSR - MCU Status Register
.equ	PORF	= 0	; Power-on reset flag
.equ	EXTRF	= 1	; External Reset Flag
.equ	BORF	= 2	; Brown-out Reset Flag
.equ	WDRF	= 3	; Watchdog Reset Flag
.equ	JTRF	= 4	; JTAG Reset Flag

; OSCCAL - Oscillator Calibration Value
.equ	CAL0	= 0	; Oscillator Calibration Value Bit0
.equ	CAL1	= 1	; Oscillator Calibration Value Bit1
.equ	CAL2	= 2	; Oscillator Calibration Value Bit2
.equ	CAL3	= 3	; Oscillator Calibration Value Bit3
.equ	CAL4	= 4	; Oscillator Calibration Value Bit4
.equ	CAL5	= 5	; Oscillator Calibration Value Bit5
.equ	CAL6	= 6	; Oscillator Calibration Value Bit6
.equ	CAL7	= 7	; Oscillator Calibration Value Bit7

; CLKPR - Clock Prescale Register
.equ	CLKPS0	= 0	; Clock Prescaler Select Bit 0
.equ	CLKPS1	= 1	; Clock Prescaler Select Bit 1
.equ	CLKPS2	= 2	; Clock Prescaler Select Bit 2
.equ	CLKPS3	= 3	; Clock Prescaler Select Bit 3
.equ	CLKPCE	= 7	; Clock Prescaler Change Enable

; PRR - Power Reduction Register
.equ	PRADC	= 0	; Power Reduction ADC
.equ	PRUSART0	= 1	; Power Reduction USART
.equ	PRSPI	= 2	; Power Reduction Serial Peripheral Interface
.equ	PRTIM1	= 3	; Power Reduction Timer/Counter1
.equ	PRLCD	= 4	; Power Reduction LCD

; SMCR - Sleep Mode Control Register
.equ	SE	= 0	; Sleep Enable
.equ	SM0	= 1	; Sleep Mode Select bit 0
.equ	SM1	= 2	; Sleep Mode Select bit 1
.equ	SM2	= 3	; Sleep Mode Select bit 2

; GPIOR2 - General Purpose IO Register 2
.equ	GPIOR20	= 0	; General Purpose IO Register 2 bit 0
.equ	GPIOR21	= 1	; General Purpose IO Register 2 bit 1
.equ	GPIOR22	= 2	; General Purpose IO Register 2 bit 2
.equ	GPIOR23	= 3	; General Purpose IO Register 2 bit 3
.equ	GPIOR24	= 4	; General Purpose IO Register 2 bit 4
.equ	GPIOR25	= 5	; General Purpose IO Register 2 bit 5
.equ	GPIOR26	= 6	; General Purpose IO Register 2 bit 6
.equ	GPIOR27	= 7	; General Purpose IO Register 2 bit 7

; GPIOR1 - General Purpose IO Register 1
.equ	GPIOR10	= 0	; General Purpose IO Register 1 bit 0
.equ	GPIOR11	= 1	; General Purpose IO Register 1 bit 1
.equ	GPIOR12	= 2	; General Purpose IO Register 1 bit 2
.equ	GPIOR13	= 3	; General Purpose IO Register 1 bit 3
.equ	GPIOR14	= 4	; General Purpose IO Register 1 bit 4
.equ	GPIOR15	= 5	; General Purpose IO Register 1 bit 5
.equ	GPIOR16	= 6	; General Purpose IO Register 1 bit 6
.equ	GPIOR17	= 7	; General Purpose IO Register 1 bit 7

; GPIOR0 - General Purpose IO Register 0
.equ	GPIOR00	= 0	; General Purpose IO Register 0 bit 0
.equ	GPIOR01	= 1	; General Purpose IO Register 0 bit 1
.equ	GPIOR02	= 2	; General Purpose IO Register 0 bit 2
.equ	GPIOR03	= 3	; General Purpose IO Register 0 bit 3
.equ	GPIOR04	= 4	; General Purpose IO Register 0 bit 4
.equ	GPIOR05	= 5	; General Purpose IO Register 0 bit 5
.equ	GPIOR06	= 6	; General Purpose IO Register 0 bit 6
.equ	GPIOR07	= 7	; General Purpose IO Register 0 bit 7


; ***** JTAG *************************
; OCDR - On-Chip Debug Related Register in I/O Memory
.equ	OCDR0	= 0	; On-Chip Debug Register Bit 0
.equ	OCDR1	= 1	; On-Chip Debug Register Bit 1
.equ	OCDR2	= 2	; On-Chip Debug Register Bit 2
.equ	OCDR3	= 3	; On-Chip Debug Register Bit 3
.equ	OCDR4	= 4	; On-Chip Debug Register Bit 4
.equ	OCDR5	= 5	; On-Chip Debug Register Bit 5
.equ	OCDR6	= 6	; On-Chip Debug Register Bit 6
.equ	OCDR7	= 7	; On-Chip Debug Register Bit 7
.equ	IDRD	= OCDR7	; For compatibility

; MCUCR - MCU Control Register
.equ	JTD	= 7	; JTAG Interface Disable

; MCUSR - MCU Status Register
;.equ	JTRF	= 4	; JTAG Reset Flag


; ***** LCD **************************
; LCDCRA - LCD Control Register A
.equ	LCDBL	= 0	; LCD Blanking
.equ	LCDIE	= 3	; LCD Interrupt Enable
.equ	LCDIF	= 4	; LCD Interrupt Flag
.equ	LCDAB	= 6	; LCD A or B waveform
.equ	LCDEN	= 7	; LCD Enable

; LCDCRB - LCD Control and Status Register B
.equ	LCDPM0	= 0	; LCD Port Mask 0
.equ	LCDPM1	= 1	; LCD Port Mask 1
.equ	LCDPM2	= 2	; LCD Port Mask 2
.equ	LCDPM3	= 3	; LCD Port Mask 3
.equ	LCDMUX0	= 4	; LCD Mux Select 0
.equ	LCDMUX1	= 5	; LCD Mux Select 1
.equ	LCD2B	= 6	; LCD 1/2 Bias Select
.equ	LCDCS	= 7	; LCD CLock Select

; LCDFRR - LCD Frame Rate Register
.equ	LCDCD0	= 0	; LCD Clock Divider 0
.equ	LCDCD1	= 1	; LCD Clock Divider 1
.equ	LCDCD2	= 2	; LCD Clock Divider 2
.equ	LCDPS0	= 4	; LCD Prescaler Select 0
.equ	LCDPS1	= 5	; LCD Prescaler Select 1
.equ	LCDPS2	= 6	; LCD Prescaler Select 2

; LCDCCR - LCD Contrast Control Register
.equ	LCDCC0	= 0	; LCD Contrast Control 0
.equ	LCDCC1	= 1	; LCD Contrast Control 1
.equ	LCDCC2	= 2	; LCD Contrast Control 2
.equ	LCDCC3	= 3	; LCD Contrast Control 3
.equ	LCDDC0	= 5	; 
.equ	LCDDC1	= 6	; 
.equ	LCDDC2	= 7	; 

; LCDDR18 - LCD Data Register 18
.equ	SEG324	= 0	; 

; LCDDR17 - LCD Data Register 17
.equ	SEG316	= 0	; 
.equ	SEG317	= 1	; 
.equ	SEG318	= 2	; 
.equ	SEG319	= 3	; 
.equ	SEG320	= 4	; 
.equ	SEG321	= 5	; 
.equ	SEG322	= 6	; 
.equ	SEG323	= 7	; 

; LCDDR16 - LCD Data Register 16
.equ	SEG308	= 0	; 
.equ	SEG309	= 1	; 
.equ	SEG310	= 2	; 
.equ	SEG311	= 3	; 
.equ	SEG312	= 4	; 
.equ	SEG313	= 5	; 
.equ	SEG314	= 6	; 
.equ	SEG315	= 7	; 

; LCDDR15 - LCD Data Register 15
.equ	SEG300	= 0	; 
.equ	SEG301	= 1	; 
.equ	SEG302	= 2	; 
.equ	SEG303	= 3	; 
.equ	SEG304	= 4	; 
.equ	SEG305	= 5	; 
.equ	SEG306	= 6	; 
.equ	SEG307	= 7	; 

; LCDDR13 - LCD Data Register 13
.equ	SEG224	= 0	; 

; LCDDR12 - LCD Data Register 12
.equ	SEG216	= 0	; 
.equ	SEG217	= 1	; 
.equ	SEG218	= 2	; 
.equ	SEG219	= 3	; 
.equ	SEG220	= 4	; 
.equ	SEG221	= 5	; 
.equ	SEG222	= 6	; 
.equ	SEG223	= 7	; 

; LCDDR11 - LCD Data Register 11
.equ	SEG208	= 0	; 
.equ	SEG209	= 1	; 
.equ	SEG210	= 2	; 
.equ	SEG211	= 3	; 
.equ	SEG212	= 4	; 
.equ	SEG213	= 5	; 
.equ	SEG214	= 6	; 
.equ	SEG215	= 7	; 

; LCDDR10 - LCD Data Register 10
.equ	SEG200	= 0	; 
.equ	SEG201	= 1	; 
.equ	SEG202	= 2	; 
.equ	SEG203	= 3	; 
.equ	SEG204	= 4	; 
.equ	SEG205	= 5	; 
.equ	SEG206	= 6	; 
.equ	SEG207	= 7	; 

; LCDDR8 - LCD Data Register 8
.equ	SEG124	= 0	; 

; LCDDR7 - LCD Data Register 7
.equ	SEG116	= 0	; 
.equ	SEG117	= 1	; 
.equ	SEG118	= 2	; 
.equ	SEG119	= 3	; 
.equ	SEG120	= 4	; 
.equ	SEG121	= 5	; 
.equ	SEG122	= 6	; 
.equ	SEG123	= 7	; 

